app/Controllers/Login.php

        } else {
            $M_Users = new MUsers();

            $checkUsersLogin = $M_Users->where('users_name', $users_name)->first();
---
SELECT *
FROM `users`
WHERE `users_name` = 'customer'
 LIMIT 1