app/Controllers/Users.php

    public function Update($users_id)
    {
        $query = $this->users->find($users_id);

        $data = [
            'title' => "Update",
            'users_id' => $users_id,
            'users_name' => $query['users_name'],
            'users_password' => $query['users_password'],
            'users_role' => $query['users_role'],
            'role' => $this->role->findAll(),
---
SELECT *
FROM `users`
WHERE `users`.`users_id` = '1'
SELECT *
FROM `role`

    public function Hapus($users_id)
    {
        $this->users->delete($users_id);
---
DELETE FROM `users`
WHERE `users_id` IN ('9')